import React from 'react';
import { useRouter } from 'next/router';

import s from './new.module.scss';

const New = () => {
  const params = useRouter();
  console.log('router params:', params);

  return (
    <section className={s.new}>
      <figure className={s.topImgCont}>
        <img
          className='coverImage'
          src='/images/news/new-top-image.webp'
          alt=''
        />
      </figure>

      <article className={`${s.article} d-flex-col container-fluid`}>
        <h1 className={s.title}>
          Незаконная рыбалка в Джизакской области нанесла ущерб природе на сумму
          57 млн 750 тыс. сумов
        </h1>
        <p>
          Биохилмахиллик турғун тушунча эмас. У табиат барча биологик
          қисмларининг ўзаро боғлиқлиги ва бир-бирини тақозо этишини тан олади.
          Кўпинча мазкур тушунчанинг уч даражаси фарқланади: турларнинг биологик
          ранг-баранглиги – барча ўсимликлар ва ҳайвонларнинг, шу жумладан турли
          бактериялар ва микроорганизмларнинг ранг-баранглиги; генетик
          ранг-баранглик – турлардаги генетик материалнинг ранг-баранглиги ва
          уларнинг ўртасидаги Биохилмахиллик; экологик тизимларнинг
          ранг-баранглиги – экологик тизимларнинг бойлиги (масалан, тоғ
          ўрмонлари, чўллар ёки саванналар, саҳролар ва денгизлар ва ҳ.к.). Бу
          уч даража жамулжам ҳолда Биохилмахилликни ташкил этади. Шу сабабли
          мазкур даражаларнинг ҳар бирини асраш умуман Биохилмахилликни асраш
          учун муҳимдир.
        </p>

        <div className={s.decorImgCont}>
          <img
            className='coverImage'
            src='/images/news/new-bg-decor.webp'
            alt=''
          />
        </div>

        <p>
          Ўзбекистоннинг умумий биологик хилма-хиллиги 27000 дан ортиқ турни
          ташкил этади. Мамлакатимизнинг ўсимлик дунёсида юксак ёки олий ўсимлик
          турлари алоҳида ажралиб туради. Ўзбекистон Республикаси ҳудудида 4500
          га яқин юксак ўсимлик турлари ва 2000 дан ортиқ замбуруғ турлари
          учрайди. Улар орасида жиддий муҳофазага муҳтож камёб ва реликт турлар
          ҳам мавжуд бўлиб, уларнинг сони 300 дан ошади. Ўзбекистон Республикаси
          Қизил китобига 314 турдаги ўсимлик тури киритилган.
        </p>

        <section className={`${s.withImg} d-flex-row-top`}>
          <img src='/images/news/pres-img.webp' alt='' />
          <p>
            Биохилмахиллик турғун тушунча эмас. У табиат барча биологик
            қисмларининг ўзаро боғлиқлиги ва бир-бирини тақозо этишини тан
            олади. Кўпинча мазкур тушунчанинг уч даражаси фарқланади: турларнинг
            биологик ранг-баранглиги – барча ўсимликлар ва ҳайвонларнинг, шу
            жумладан турли бактериялар ва микроорганизмларнинг ранг-баранглиги;
            генетик ранг-баранглик – турлардаги генетик материалнинг
            ранг-баранглиги ва уларнинг ўртасидаги Биохилмахиллик; экологик
            тизимларнинг ранг-баранглиги – экологик тизимларнинг бойлиги
            (масалан, тоғ ўрмонлари, чўллар ёки саванналар, саҳролар ва
            денгизлар ва ҳ.к.). Бу уч даража жамулжам ҳолда Биохилмахилликни
            ташкил этади. Шу сабабли мазкур даражаларнинг ҳар бирини асраш
            умуман Биохилмахилликни асраш учун муҳимдир.
          </p>
        </section>

        <section className={`${s.withImg} d-flex-row-top`}>
          <p>
            Биохилмахиллик турғун тушунча эмас. У табиат барча биологик
            қисмларининг ўзаро боғлиқлиги ва бир-бирини тақозо этишини тан
            олади. Кўпинча мазкур тушунчанинг уч даражаси фарқланади: турларнинг
            биологик ранг-баранглиги – барча ўсимликлар ва ҳайвонларнинг, шу
            жумладан турли бактериялар ва микроорганизмларнинг ранг-баранглиги;
            генетик ранг-баранглик – турлардаги генетик материалнинг
            ранг-баранглиги ва уларнинг ўртасидаги Биохилмахиллик; экологик
            тизимларнинг ранг-баранглиги – экологик тизимларнинг бойлиги
            (масалан, тоғ ўрмонлари, чўллар ёки саванналар, саҳролар ва
            денгизлар ва ҳ.к.). Бу уч даража жамулжам ҳолда Биохилмахилликни
            ташкил этади. Шу сабабли мазкур даражаларнинг ҳар бирини асраш
            умуман Биохилмахилликни асраш учун муҳимдир.
          </p>
          <img src='/images/news/pres-img.webp' alt='' />
        </section>
      </article>
    </section>
  );
};

export default New;
